# Analysis of US Adult Census Data, 1994

## Importing Numpy and Pandas for data analysis

In [1]:
import numpy as np
import pandas as pd
pd.set_option('display.precision',2)

## Loading online dataset

In [2]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', names = ['Age','Workclass','Fnlwgt','Education','Education-num','Marital-status','Occupation','Relationship',
                                 'Race','Sex','Capital-Gain','Capital-Loss','Hours-per-Week','Native-Country','Salary'])
df.head(10)

,Age,Workclass,Fnlwgt,Education,Education-num,Marital-status,Occupation,Relationship,Race,Sex,Capital-Gain,Capital-Loss,Hours-per-Week,Native-Country,Salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K

## Getting the size of the data

In [3]:
df.shape

(32561, 15)

## Analysing each feature of the dataset

In [4]:
df.describe()

,Age,Fnlwgt,Education-num,Capital-Gain,Capital-Loss,Hours-per-Week
count,32561.00,3.26e+04,32561.00,32561.00,32561.00,32561.00
mean,38.58,1.90e+05,10.08,1077.65,87.30,40.44
std,13.64,1.06e+05,2.57,7385.29,402.96,12.35
min,17.00,1.23e+04,1.00,0.00,0.00,1.00
25%,28.00,1.18e+05,9.00,0.00,0.00,40.00
50%,37.00,1.78e+05,10.00,0.00,0.00,40.00
75%,48.00,2.37e+05,12.00,0.00,0.00,45.00
max,90.00,1.48e+06,16.00,99999.00,4356.00,99.00

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Age             32561 non-null  int64
 1   Workclass       32561 non-null  object
 2   Fnlwgt          32561 non-null  int64
 3   Education       32561 non-null  object
 4   Education-num   32561 non-null  int64
 5   Marital-status  32561 non-null  object
 6   Occupation      32561 non-null  object
 7   Relationship    32561 non-null  object
 8   Race            32561 non-null  object
 9   Sex             32561 non-null  object
 10  Capital-Gain    32561 non-null  int64
 11  Capital-Loss    32561 non-null  int64
 12  Hours-per-Week  32561 non-null  int64
 13  Native-Country  32561 non-null  object
 14  Salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

## Analysing the number of males and females

In [6]:
df.describe(include = ['object'])['Sex']

count     32561
unique        2
top        Male
freq      21790
Name: Sex, dtype: object

In [7]:
df['Sex'].value_counts()

 Male      21790
 Female    10771
Name: Sex, dtype: int64

In [8]:
df[df['Sex']==' Female']['Age'].mean()

36.85823043357163

## Analysing percent of German and Indians in US Census Data, 1994

In [9]:
df['Native-Country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: Native-Country, dtype: int64

In [10]:
no_of_germans = df[df['Native-Country']==' Germany'].count()['Native-Country']
total_natives = df.count()['Native-Country']
no_of_germans / total_natives * 100

0.42074874850281013

In [11]:
no_of_indians = df[df['Native-Country']==' India'].count()['Native-Country']
total_natives = df.count()['Native-Country']
no_of_indians / total_natives * 100

0.3071158748195694

## Analysing the relation between the age and Salary

In [12]:
age_rich = df.loc[df['Salary'] == ' >50K','Age']
age_poor = df.loc[df['Salary'] == ' <=50K','Age']
print(f'The avg. age of rich are {round(age_rich.mean())}+-{round(age_rich.std())} and avg. age of poor are {round(age_poor.mean())}+-{round(age_poor.std())} ')

The avg. age of rich are 44+-11 and avg. age of poor are 37+-14

## Analysing if the people who are just high school grad are earning more than 50K

In [13]:
df.loc[df['Salary']==' >50K','Education'].value_counts()[-6:]

 11th       60
 7th-8th    40
 12th       33
 9th        27
 5th-6th    16
 1st-4th     6
Name: Education, dtype: int64

## Which is the maximum life of American-Indian-Eskimo race in USA?

In [14]:
df.loc[df['Race']==' Amer-Indian-Eskimo','Age'].max()

82

## Who earn more? Married or Singles?

In [15]:
married = df[df['Marital-status'].apply(lambda marry: marry[0:8]==' Married')]
married_rich = married.loc[married['Salary']==' >50K'].count()['Marital-status']

total_rich = df.loc[df['Salary'] == ' >50K'].count()['Marital-status']

single_rich = total_rich - married_rich
print(f'married people: {married_rich}, singles: {single_rich}')

married people: 6736, singles: 1105

## Relation between Hard Work and Money

In [16]:
hard_work = df.loc[df['Hours-per-Week'] == 99]
total_hard_work = hard_work.count()['Hours-per-Week']
hard_work_money = hard_work.loc[hard_work['Salary'] == ' >50K'].count()['Salary']

hard_work_money / total_hard_work * 100

29.411764705882355

## Analysing the immigrants of two countries (Japan, India) and finding out the relation between their number of working hours and salary

In [17]:
japan = df.loc[df['Salary']==' <=50K']
japan.loc[japan['Native-Country']==' Japan'].describe()

,Age,Fnlwgt,Education-num,Capital-Gain,Capital-Loss,Hours-per-Week
count,38.00,38.00,38.00,38.00,38.00,38.0
mean,35.32,197242.53,10.71,201.47,41.84,41.0
std,9.39,110715.68,1.84,702.34,257.93,11.9
min,19.00,29807.00,9.00,0.00,0.00,10.0
25%,29.00,136372.25,9.00,0.00,0.00,40.0
50%,34.00,167426.00,10.00,0.00,0.00,40.0
75%,41.00,249460.00,13.00,0.00,0.00,41.5
max,61.00,536725.00,14.00,2885.00,1590.00,65.0

In [18]:
japan = df.loc[df['Salary']==' >50K']
japan.loc[japan['Native-Country']==' Japan'].describe()

,Age,Fnlwgt,Education-num,Capital-Gain,Capital-Loss,Hours-per-Week
count,24.00,24.00,24.00,24.00,24.00,24.00
mean,42.88,167433.71,12.58,6258.75,82.38,47.96
std,6.77,131000.39,2.36,20485.67,403.55,16.12
min,33.00,22201.00,6.00,0.00,0.00,21.00
25%,37.75,81099.75,12.75,0.00,0.00,40.00
50%,41.00,124334.00,13.00,0.00,0.00,42.50
75%,47.25,195285.00,14.00,1196.75,0.00,50.00
max,56.00,586657.00,16.00,99999.00,1977.00,99.00

In [19]:
india = df.loc[df['Salary']==' <=50K']
india.loc[india['Native-Country']==' India'].describe()

,Age,Fnlwgt,Education-num,Capital-Gain,Capital-Loss,Hours-per-Week
count,60.00,60.00,60.00,60.00,60.00,60.00
mean,35.73,171203.47,11.48,209.92,26.32,38.23
std,11.45,80260.07,3.16,884.73,203.85,12.62
min,17.00,31740.00,1.00,0.00,0.00,8.00
25%,27.00,122145.25,10.00,0.00,0.00,35.00
50%,32.00,148114.00,13.00,0.00,0.00,40.00
75%,46.00,191359.25,14.00,0.00,0.00,40.00
max,61.00,361280.00,16.00,5013.00,1579.00,84.00

In [20]:
india = df.loc[df['Salary']==' >50K']
india.loc[india['Native-Country']==' India'].describe()

,Age,Fnlwgt,Education-num,Capital-Gain,Capital-Loss,Hours-per-Week
count,40.00,40.00,40.00,40.00,40.00,40.00
mean,41.62,164542.52,13.85,8697.42,288.32,46.48
std,9.92,75060.19,1.58,26507.59,705.69,10.06
min,23.00,23510.00,9.00,0.00,0.00,20.00
25%,34.00,115244.00,13.00,0.00,0.00,40.00
50%,41.50,143003.00,14.00,0.00,0.00,41.50
75%,48.75,211534.50,15.00,775.75,0.00,50.00
max,61.00,366957.00,16.00,99999.00,2415.00,72.00